[
  {
    "id": "bus_services_1",
    "title": "CMU-Africa Shuttle Bus Services",
    "category": "Transportation",
    "content": "CMU-Africa provides free shuttle bus services for students, faculty, and staff. The shuttle operates on weekdays from 7:00 AM to 10:00 PM, with buses departing every 30 minutes during peak hours (7-9 AM and 5-7 PM) and every hour during off-peak hours. The shuttle connects the main campus in Kigali with nearby residential areas including Kimihurura, Remera, and Nyarutarama.",
    "keywords": ["bus", "shuttle", "transportation", "schedule", "timings"]
  },
  {
    "id": "bus_services_2",
    "title": "Shuttle Bus Routes and Stops",
    "category": "Transportation",
    "content": "The CMU-Africa shuttle operates three main routes: Route A serves Kimihurura and City Center, Route B covers Remera and Kisimenti, and Route C connects Nyarutarama and Gacuriro. All routes begin and end at the main campus building. Students can track the shuttle in real-time using the CMU-Africa mobile app. During weekends, a limited service operates from 9:00 AM to 6:00 PM with hourly departures.",
    "keywords": ["bus", "routes", "stops", "tracking", "weekend"]
  },
  {
    "id": "degrees_masters_1",
    "title": "Master's Programs at CMU-Africa",
    "category": "Academic Programs",
    "content": "CMU-Africa offers three Master's degree programs: Master of Science in Information Technology (MSIT), Master of Science in Electrical and Computer Engineering (MSECE), and Master of Science in Engineering Artificial Intelligence (MSEAI). All programs are full-time, typically completed in 21 months, and follow Carnegie Mellon University's rigorous curriculum standards. Graduates receive degrees from Carnegie Mellon University.",
    "keywords": ["masters", "degrees", "programs", "MSIT", "MSECE", "MSEAI", "AI", "engineering"]
  },
  {
    "id": "degrees_curriculum_1",
    "title": "MSIT Program Curriculum",
    "category": "Academic Programs",
    "content": "The Master of Science in Information Technology (MSIT) program focuses on software engineering, distributed systems, and mobile computing. Core courses include Software Engineering, Distributed Systems, Mobile and IoT Systems, and Database Management. Students complete a capstone project in their final semester, often working with industry partners. The program emphasizes practical, hands-on learning with real-world applications.",
    "keywords": ["MSIT", "curriculum", "courses", "software", "capstone"]
  },
  {
    "id": "degrees_ai_1",
    "title": "MSEAI Program Overview",
    "category": "Academic Programs",
    "content": "The Master of Science in Engineering Artificial Intelligence (MSEAI) is CMU-Africa's newest program, launched in 2023. It covers machine learning, deep learning, computer vision, natural language processing, and AI ethics. Students work on cutting-edge AI projects and research. The program prepares graduates for careers in AI research, development, and deployment across various industries including healthcare, finance, and technology.",
    "keywords": ["MSEAI", "AI", "artificial intelligence", "machine learning", "deep learning", "NLP"]
  },
  {
    "id": "faculty_1",
    "title": "CMU-Africa Faculty",
    "category": "Faculty",
    "content": "CMU-Africa has a diverse faculty comprising professors from Carnegie Mellon University and distinguished African scholars. Faculty members have PhDs from top institutions and bring extensive industry and research experience. They teach courses, mentor students, and conduct research in areas including AI, cybersecurity, mobile systems, and software engineering. The faculty-to-student ratio is approximately 1:10, ensuring personalized attention.",
    "keywords": ["faculty", "professors", "teaching", "research", "mentorship"]
  },
  {
    "id": "faculty_research_1",
    "title": "Research at CMU-Africa",
    "category": "Faculty",
    "content": "CMU-Africa faculty and students engage in cutting-edge research addressing African challenges. Research areas include AI for healthcare, mobile money systems, agricultural technology, smart cities, and cybersecurity. The campus hosts regular research seminars and colloquia. Students are encouraged to participate in research projects and publish papers in international conferences and journals.",
    "keywords": ["research", "publications", "projects", "innovation", "technology"]
  },
  {
    "id": "facilities_library_1",
    "title": "Library and Learning Resources",
    "category": "Campus Facilities",
    "content": "The CMU-Africa library provides access to extensive digital resources including IEEE Xplore, ACM Digital Library, and SpringerLink. Students have 24/7 access to online journals, research papers, and e-books. The physical library offers study spaces, group collaboration rooms, and quiet zones. Librarians provide research support and information literacy training.",
    "keywords": ["library", "resources", "books", "research", "study"]
  },
  {
    "id": "facilities_labs_1",
    "title": "Computer Labs and Facilities",
    "category": "Campus Facilities",
    "content": "CMU-Africa features state-of-the-art computer labs equipped with high-performance workstations, GPUs for AI/ML work, and specialized equipment for IoT and robotics projects. The campus has dedicated labs for software development, networking, electronics, and AI research. All labs have high-speed internet connectivity and are accessible to students 24/7 with appropriate authorization.",
    "keywords": ["labs", "computers", "equipment", "facilities", "GPU", "workspace"]
  },
  {
    "id": "facilities_campus_1",
    "title": "Campus Amenities",
    "category": "Campus Facilities",
    "content": "The CMU-Africa campus in Kigali includes modern classrooms, collaboration spaces, a cafeteria serving diverse cuisines, prayer rooms, and recreational areas. The campus has reliable WiFi throughout, backup power systems, and secure access control. There are dedicated spaces for student organizations, events, and social activities. The campus is designed to foster innovation and collaboration.",
    "keywords": ["campus", "amenities", "cafeteria", "wifi", "facilities", "social spaces"]
  },
  {
    "id": "admissions_1",
    "title": "Admission Requirements",
    "category": "Admissions",
    "content": "Admission to CMU-Africa requires a bachelor's degree in a relevant field, strong academic record, GRE scores (recommended but not required), English proficiency (TOEFL/IELTS for non-native speakers), letters of recommendation, statement of purpose, and resume. The admissions process is competitive and holistic, considering academic excellence, work experience, and potential for impact. Application deadlines are typically in January for Fall admission.",
    "keywords": ["admissions", "requirements", "application", "GRE", "TOEFL", "eligibility"]
  },
  {
    "id": "admissions_scholarships_1",
    "title": "Scholarships and Financial Aid",
    "category": "Admissions",
    "content": "CMU-Africa offers various scholarship opportunities including full and partial tuition scholarships, need-based financial aid, and fellowship programs. The MasterCard Foundation Scholars Program provides comprehensive support including tuition, living expenses, and leadership development. Students are automatically considered for scholarships when they apply. Additional funding opportunities include research assistantships and teaching assistantships.",
    "keywords": ["scholarships", "financial aid", "funding", "MasterCard Foundation", "assistantships"]
  },
  {
    "id": "student_life_1",
    "title": "Student Life and Organizations",
    "category": "Student Life",
    "content": "CMU-Africa has a vibrant student community with various clubs and organizations including the AI Club, Women in Technology, Sports Club, and Cultural Exchange Society. Regular events include hackathons, tech talks, cultural celebrations, and social gatherings. Students also participate in community outreach programs and volunteer activities. The campus fosters a supportive and inclusive environment.",
    "keywords": ["student life", "clubs", "organizations", "events", "community", "activities"]
  },
  {
    "id": "career_services_1",
    "title": "Career Services and Placement",
    "category": "Career Services",
    "content": "CMU-Africa's Career Services team helps students with internship searches, job placements, resume reviews, interview preparation, and career counseling. The campus hosts career fairs attracting leading technology companies from Africa and globally. Alumni work at top companies including Google, Microsoft, Amazon, and innovative African startups. The placement rate for graduates is over 95% within six months of graduation.",
    "keywords": ["career", "jobs", "internships", "placement", "companies", "employment"]
  },
  {
    "id": "contact_1",
    "title": "Contact Information",
    "category": "Contact",
    "content": "CMU-Africa is located in Kigali, Rwanda at the University of Rwanda - College of Science and Technology Campus. Main reception: +250 788 123 456. Email: info@cmu.ac.rw. Admissions inquiries: admissions-africa@cs.cmu.edu. For urgent matters, contact the campus security at +250 788 987 654. Office hours are Monday to Friday, 8:00 AM to 5:00 PM.",
    "keywords": ["contact", "phone", "email", "address", "location", "reception"]
  }
]
