[
  {
    "id": "bus_001",
    "category": "Transportation",
    "title": "Bus Schedule - Weekdays",
    "content": "CMU-Africa provides shuttle services for students and staff. Weekday schedule: Morning departures from Kigali Heights at 7:30 AM, 8:00 AM, and 8:30 AM. Evening departures from campus at 5:00 PM, 6:00 PM, and 7:00 PM. Buses stop at major residential areas including Kimihurura, Kacyiru, and Remera.",
    "tags": ["bus", "transportation", "schedule", "weekday"]
  },
  {
    "id": "bus_002",
    "category": "Transportation",
    "title": "Bus Schedule - Weekends",
    "content": "Weekend shuttle services are limited. Saturday: Departures from Kigali Heights at 9:00 AM and 12:00 PM, returns at 4:00 PM and 6:00 PM. Sunday: Single departure at 10:00 AM, return at 5:00 PM. Weekend services require advance booking through the transportation office.",
    "tags": ["bus", "transportation", "schedule", "weekend"]
  },
  {
    "id": "bus_003",
    "category": "Transportation",
    "title": "Bus Routes and Stops",
    "content": "Route 1: Kigali Heights → Kimihurura → CMU-Africa Campus. Route 2: Kacyiru → Remera → CMU-Africa Campus. Route 3: City Center → Nyarutarama → CMU-Africa Campus. Each route takes approximately 25-35 minutes depending on traffic.",
    "tags": ["bus", "transportation", "routes", "stops"]
  },
  {
    "id": "bus_004",
    "category": "Transportation",
    "title": "Transportation Rules and Policies",
    "content": "Students must present valid CMU-Africa ID cards to board shuttles. Maximum capacity per bus is 30 passengers. Food and drinks are not allowed on buses. Late arrivals (more than 5 minutes after scheduled departure) may not be accommodated. For emergencies, contact transportation office at +250-788-XXX-XXX.",
    "tags": ["bus", "transportation", "rules", "policy"]
  },
  {
    "id": "prog_001",
    "category": "Academic Programs",
    "title": "Master of Science in Information Technology (MSIT)",
    "content": "The MSIT program is a 21-month intensive program designed to prepare students for leadership roles in technology. Core courses include Software Engineering, Machine Learning, Data Science, and Systems Design. Program requires 192 units of coursework plus a capstone project. Admission requirements: Bachelor's degree in CS or related field, GRE scores, TOEFL/IELTS for international students.",
    "tags": ["masters", "msit", "degree", "program", "information technology"]
  },
  {
    "id": "prog_002",
    "category": "Academic Programs",
    "title": "Master of Science in Electrical and Computer Engineering (MSECE)",
    "content": "The MSECE program focuses on advanced topics in electrical and computer engineering. Duration: 21 months. Core areas include Signal Processing, Computer Architecture, Embedded Systems, and VLSI Design. Students must complete 192 units including thesis or capstone project. Prerequisites: Strong background in electrical engineering, mathematics, and programming.",
    "tags": ["masters", "msece", "degree", "program", "electrical engineering"]
  },
  {
    "id": "prog_003",
    "category": "Academic Programs",
    "title": "PhD Programs",
    "content": "CMU-Africa offers PhD programs in Information Technology and Electrical and Computer Engineering. Duration: 4-5 years. Requirements include coursework (96 units minimum), qualifying exams, research proposal defense, dissertation research, and final dissertation defense. Applicants need Master's degree with strong research background. Full funding available for admitted students including tuition and stipend.",
    "tags": ["phd", "doctorate", "degree", "program", "research"]
  },
  {
    "id": "prog_004",
    "category": "Academic Programs",
    "title": "Course Requirements and Registration",
    "content": "All students must maintain a minimum QPA of 3.0. Full-time students take 48-54 units per semester. Course registration occurs at the beginning of each semester through the Student Information System (SIS). Add/drop period is the first week of classes. Late registration requires academic advisor approval. Prerequisite requirements must be met before enrolling in advanced courses.",
    "tags": ["courses", "registration", "requirements", "academic policy"]
  },
  {
    "id": "fac_001",
    "category": "Faculty",
    "title": "Dr. Sarah Mwangi - Assistant Professor",
    "content": "Dr. Sarah Mwangi specializes in Machine Learning and Artificial Intelligence. Research areas include natural language processing, computer vision, and deep learning applications for African contexts. Publications in NeurIPS, ICML, and ACL. Office: Building A, Room 301. Office hours: Tuesday and Thursday, 2-4 PM. Email: smwangi@cmu.edu",
    "tags": ["faculty", "professor", "machine learning", "AI"]
  },
  {
    "id": "fac_002",
    "category": "Faculty",
    "title": "Dr. James Okello - Associate Professor",
    "content": "Dr. James Okello's research focuses on Distributed Systems and Cloud Computing. Current projects include edge computing for IoT, blockchain applications in supply chain, and scalable data processing systems. Published over 50 papers in top-tier conferences. Office: Building A, Room 305. Office hours: Monday and Wednesday, 3-5 PM. Email: jokello@cmu.edu",
    "tags": ["faculty", "professor", "distributed systems", "cloud computing"]
  },
  {
    "id": "fac_003",
    "category": "Faculty",
    "title": "Dr. Aminata Diallo - Assistant Professor",
    "content": "Dr. Aminata Diallo specializes in Embedded Systems and IoT. Research interests include low-power sensor networks, real-time operating systems, and hardware-software co-design. Active collaborations with industry partners across Africa. Office: Building B, Room 201. Office hours: Wednesday and Friday, 1-3 PM. Email: adiallo@cmu.edu",
    "tags": ["faculty", "professor", "embedded systems", "IoT"]
  },
  {
    "id": "fac_004",
    "category": "Faculty",
    "title": "Dr. Michael Chen - Professor",
    "content": "Dr. Michael Chen is a renowned expert in Cybersecurity and Network Security. Research areas include cryptography, secure communication protocols, and privacy-preserving technologies. Recipient of multiple NSF grants. Teaches Advanced Network Security and Cryptography courses. Office: Building A, Room 310. Office hours: Tuesday, 10 AM-12 PM. Email: mchen@cmu.edu",
    "tags": ["faculty", "professor", "cybersecurity", "network security"]
  },
  {
    "id": "lead_001",
    "category": "Leadership",
    "title": "Dr. Victoria Bampoe - Campus Director",
    "content": "Dr. Victoria Bampoe serves as the Director of CMU-Africa. She oversees all academic and administrative operations on campus. With over 20 years of experience in higher education, Dr. Bampoe leads strategic initiatives for research, partnerships, and student experience. Office: Administration Building, Room 100. Contact: vbampoe@cmu.edu",
    "tags": ["leadership", "administration", "director"]
  },
  {
    "id": "lead_002",
    "category": "Leadership",
    "title": "Dr. Robert Nsanzimana - Associate Director for Academic Affairs",
    "content": "Dr. Robert Nsanzimana oversees academic programs, curriculum development, and student academic affairs. He works closely with faculty to maintain academic excellence and support student success. Office: Administration Building, Room 102. Office hours: Monday-Friday, 9 AM-5 PM. Email: rnsanzimana@cmu.edu",
    "tags": ["leadership", "administration", "academic affairs"]
  },
  {
    "id": "lead_003",
    "category": "Leadership",
    "title": "Ms. Grace Uwase - Director of Student Services",
    "content": "Ms. Grace Uwase leads the Student Services department, managing student life, housing, health services, and extracurricular activities. She ensures students have support systems for academic and personal success. Office: Student Center, Room 15. Drop-in hours: Monday-Friday, 10 AM-4 PM. Email: guwase@cmu.edu",
    "tags": ["leadership", "student services", "support"]
  },
  {
    "id": "fac_001",
    "category": "Facilities",
    "title": "Library and Study Spaces",
    "content": "The CMU-Africa Library is open Monday-Friday 7 AM to 10 PM, weekends 9 AM to 8 PM. Features include: individual study rooms (bookable via online portal), collaborative spaces, computer lab with 50 workstations, printing services, and extensive digital resources. Library staff available for research assistance. Quiet zones enforced on the second floor.",
    "tags": ["library", "facilities", "study", "resources"]
  },
  {
    "id": "fac_002",
    "category": "Facilities",
    "title": "Computer Labs and Maker Space",
    "content": "Three computer labs available: Lab A (60 workstations, Windows/Linux), Lab B (40 workstations, specialized software), Lab C (30 high-performance machines for ML/data science). Maker Space includes 3D printers, electronics workbenches, prototyping tools. Access requires lab orientation. Hours: Monday-Friday 8 AM-8 PM, Saturday 10 AM-6 PM.",
    "tags": ["computer lab", "facilities", "maker space", "technology"]
  },
  {
    "id": "fac_003",
    "category": "Facilities",
    "title": "Student Center and Recreation",
    "content": "The Student Center provides dining facilities, lounge areas, game room, and meeting spaces. Cafeteria serves breakfast (7-9 AM), lunch (12-2 PM), and dinner (6-8 PM). Recreation facilities include gym (6 AM-10 PM daily), basketball court, and outdoor seating areas. Student clubs can book meeting rooms through the Student Services office.",
    "tags": ["student center", "facilities", "recreation", "dining"]
  },
  {
    "id": "serv_001",
    "category": "Student Services",
    "title": "Health and Wellness Services",
    "content": "Campus health clinic provides basic medical care, counseling services, and wellness programs. Hours: Monday-Friday 8 AM-5 PM. Emergency services available 24/7 (call +250-788-XXX-XXX). Services include general consultations, mental health counseling, health education workshops. All enrolled students have access. Located in Student Center, Ground Floor.",
    "tags": ["health", "wellness", "counseling", "services"]
  },
  {
    "id": "serv_002",
    "category": "Student Services",
    "title": "Career Development Center",
    "content": "The Career Development Center assists with internships, job placement, resume reviews, interview preparation, and career counseling. Services include: one-on-one career advising, resume/CV workshops, mock interviews, networking events with industry partners, job fair organization. Schedule appointments via career.cmu.edu/africa. Office: Administration Building, Room 120.",
    "tags": ["career", "employment", "services", "internship"]
  },
  {
    "id": "serv_003",
    "category": "Student Services",
    "title": "International Student Support",
    "content": "International Student Services helps with visa documentation, immigration compliance, cultural adjustment, and orientation programs. Regular workshops on living in Rwanda, banking, housing, and local customs. Emergency support available. Contact: international@cmu.edu or visit Office of International Education, Administration Building, Room 115. Hours: Monday-Friday, 9 AM-5 PM.",
    "tags": ["international", "visa", "immigration", "services"]
  },
  {
    "id": "serv_004",
    "category": "Student Services",
    "title": "Housing and Accommodation",
    "content": "CMU-Africa partners with local housing providers for student accommodation. Options include shared apartments (2-4 students) and private studios. Housing office assists with finding accommodation, lease agreements, and roommate matching. Monthly rent ranges from $200-$500 depending on location and type. Contact housing@cmu.edu for current availability. Office: Student Center, Room 10.",
    "tags": ["housing", "accommodation", "residential", "services"]
  },
  {
    "id": "acad_001",
    "category": "Academic Policies",
    "title": "Grading and Academic Standards",
    "content": "Grading scale: A (4.0), A- (3.67), B+ (3.33), B (3.0), B- (2.67), C+ (2.33), C (2.0), C- (1.67), D (1.0), F (0.0). Students must maintain minimum QPA of 3.0 to remain in good academic standing. Academic probation if QPA falls below 3.0 for one semester. Academic suspension if below 3.0 for two consecutive semesters. Grade appeals must be submitted within two weeks of grade posting.",
    "tags": ["grading", "academic", "policy", "standards"]
  },
  {
    "id": "acad_002",
    "category": "Academic Policies",
    "title": "Academic Integrity and Honor Code",
    "content": "CMU-Africa upholds strict academic integrity standards. Violations include plagiarism, cheating, unauthorized collaboration, and falsifying data. First offense: grade penalty and warning. Second offense: failing grade and academic probation. Third offense: dismissal from program. All students must complete academic integrity training. Report violations to academicintegrity@cmu.edu.",
    "tags": ["integrity", "honor code", "academic", "policy"]
  },
  {
    "id": "res_001",
    "category": "Research",
    "title": "Research Centers and Labs",
    "content": "CMU-Africa hosts several research centers: AI for Social Good Lab, Distributed Systems Research Group, Embedded Systems Lab, Cybersecurity Research Center. Research opportunities available for both Master's and PhD students. Funding available through research assistantships. Contact faculty directly or research@cmu.edu for opportunities.",
    "tags": ["research", "labs", "opportunities"]
  },
  {
    "id": "res_002",
    "category": "Research",
    "title": "Research Funding and Grants",
    "content": "Research funding sources include: CMU internal grants, NSF Africa programs, industry partnerships, and African Union research initiatives. Graduate students can apply for travel grants to present at conferences (up to $2000 per year). PhD students receive annual research budget of $5000. Grant writing workshops offered each semester.",
    "tags": ["research", "funding", "grants", "scholarships"]
  },
  {
    "id": "fin_001",
    "category": "Financial Aid",
    "title": "Scholarships and Financial Aid",
    "content": "CMU-Africa offers merit-based scholarships covering 25%-100% of tuition. Additional funding: Mastercard Foundation Scholarships (full funding), Google Africa Scholarship, Women in Tech Scholarships. PhD students receive full tuition waiver plus monthly stipend. Application deadlines: January 15 for Fall admission. Financial aid decisions made by March 1. Contact finaid@cmu.edu.",
    "tags": ["financial aid", "scholarships", "funding", "tuition"]
  },
  {
    "id": "fin_002",
    "category": "Financial Aid",
    "title": "Tuition and Fees",
    "content": "2024-2025 Academic Year Tuition: MSIT/MSECE: $25,000 per year. Additional fees: Technology fee $500/semester, Health insurance $800/year, Student activities $200/year. Payment plans available. Financial aid applications open October 1. Payment deadlines: Fall semester - August 15, Spring semester - December 15.",
    "tags": ["tuition", "fees", "costs", "financial"]
  },
  {
    "id": "event_001",
    "category": "Events",
    "title": "Campus Events and Activities",
    "content": "Regular campus events include: Weekly Tech Talks (Wednesdays 5 PM), Research Symposium (annually in May), Career Fair (October and March), Cultural Festival (June), Hackathons (monthly). Student clubs: Tech Entrepreneurship Club, Women in Computing, African AI Association, Robotics Club. Check events calendar at events.cmu.edu/africa.",
    "tags": ["events", "activities", "student life", "clubs"]
  }
]
