
[
  {
    "id": "bus_001",
    "title": "Campus Shuttle Service Overview",
    "category": "Transportation",
    "content": "CMU-Africa provides a free shuttle service for students and staff. The shuttle operates Monday through Friday from 7:00 AM to 7:00 PM. There are three main routes: City Route (connects to downtown Kigali), Campus Loop (internal campus circulation), and Residential Route (serves student housing areas). Shuttles run every 30 minutes during peak hours and hourly during off-peak times.",
    "metadata": {
      "last_updated": "2024-10-01",
      "language": "en"
    }
  },
  {
    "id": "bus_002",
    "title": "Shuttle Schedule and Routes",
    "category": "Transportation",
    "content": "Morning shuttles start at 7:00 AM from the residential areas. Peak hours are 7-9 AM and 5-7 PM with 30-minute intervals. City Route stops include: Kigali Heights, Union Trade Center, and City Plaza. Campus Loop covers: Main Building, Library, Research Center, Cafeteria, and Sports Complex. To track shuttle locations in real-time, use the CMU-Africa mobile app or check the digital boards at major stops.",
    "metadata": {
      "last_updated": "2024-10-01",
      "language": "en"
    }
  },
  {
    "id": "programs_001",
    "title": "Master's Programs at CMU-Africa",
    "category": "Academic Programs",
    "content": "CMU-Africa offers several Master's degree programs: Master of Science in Information Technology (MSIT), Master of Science in Electrical and Computer Engineering (MS ECE), and Master of Science in Engineering Artificial Intelligence (MS AI). All programs are full-time and typically take 18-24 months to complete. The curriculum combines coursework, practical projects, and a capstone or thesis requirement.",
    "metadata": {
      "last_updated": "2024-09-15",
      "language": "en"
    }
  },
  {
    "id": "programs_002",
    "title": "MSIT Program Details",
    "category": "Academic Programs",
    "content": "The Master of Science in Information Technology (MSIT) program focuses on software engineering, mobile and IoT systems, embedded systems, and information security. Students complete 144 units over 3-4 semesters. Core courses include Software Engineering, Distributed Systems, and Mobile and IoT Systems. Students can choose electives in areas like Machine Learning, Data Science, or Cybersecurity. The program culminates in a capstone project or thesis.",
    "metadata": {
      "last_updated": "2024-09-15",
      "language": "en"
    }
  },
  {
    "id": "programs_003",
    "title": "MS ECE Program Details",
    "category": "Academic Programs",
    "content": "The Master of Science in Electrical and Computer Engineering (MS ECE) program covers digital systems, signal processing, computer architecture, and communications systems. The program requires 144 units and includes courses like Digital Signal Processing, VLSI Design, Computer Architecture, and Wireless Communications. Students conduct research in areas such as embedded systems, IoT, or communications. Both course-based and research-based options are available.",
    "metadata": {
      "last_updated": "2024-09-15",
      "language": "en"
    }
  },
  {
    "id": "programs_004",
    "title": "MS AI Program Details",
    "category": "Academic Programs",
    "content": "The Master of Science in Engineering Artificial Intelligence (MS AI) is CMU-Africa's newest program, focusing on machine learning, deep learning, computer vision, and natural language processing. Students learn to design and implement AI systems for real-world applications. Core courses include Machine Learning, Deep Learning, Computer Vision, and AI Ethics. The program emphasizes practical experience through projects with industry partners and culminates in a capstone project addressing African challenges.",
    "metadata": {
      "last_updated": "2024-09-15",
      "language": "en"
    }
  },
  {
    "id": "faculty_001",
    "title": "Faculty Overview",
    "category": "Faculty",
    "content": "CMU-Africa has a diverse faculty comprising professors from Carnegie Mellon University in Pittsburgh and local African faculty. Faculty members are experts in their fields with extensive research experience. They teach courses, supervise student research, and collaborate with industry partners. Faculty research areas include artificial intelligence, machine learning, software engineering, embedded systems, IoT, cybersecurity, and data science.",
    "metadata": {
      "last_updated": "2024-08-20",
      "language": "en"
    }
  },
  {
    "id": "faculty_002",
    "title": "Faculty Research Areas",
    "category": "Faculty",
    "content": "CMU-Africa faculty conduct cutting-edge research in multiple domains. AI and Machine Learning research focuses on applications in healthcare, agriculture, and education. The Software Engineering group works on mobile applications and distributed systems. IoT and Embedded Systems researchers develop solutions for smart cities and industrial automation. Cybersecurity faculty investigate network security and privacy-preserving technologies. Many research projects address specific African challenges and collaborate with local organizations.",
    "metadata": {
      "last_updated": "2024-08-20",
      "language": "en"
    }
  },
  {
    "id": "facilities_001",
    "title": "Campus Facilities Overview",
    "category": "Campus Facilities",
    "content": "CMU-Africa campus features modern facilities including classrooms equipped with smart boards, computer labs with high-performance workstations, a comprehensive library with digital resources, research labs for specialized projects, collaborative workspaces, a cafeteria, recreation areas, and a sports complex. The campus has high-speed internet connectivity throughout and 24/7 security.",
    "metadata": {
      "last_updated": "2024-10-05",
      "language": "en"
    }
  },
  {
    "id": "facilities_002",
    "title": "Library and Learning Resources",
    "category": "Campus Facilities",
    "content": "The CMU-Africa library provides access to extensive digital resources including academic journals, e-books, and research databases. Students have access to Carnegie Mellon's global library system. The library offers study spaces, private discussion rooms, and collaboration areas. Operating hours are Monday-Friday 8:00 AM to 10:00 PM, and weekends 10:00 AM to 6:00 PM. Library staff provide research assistance and information literacy training.",
    "metadata": {
      "last_updated": "2024-10-05",
      "language": "en"
    }
  },
  {
    "id": "facilities_003",
    "title": "Computer Labs and Technical Resources",
    "category": "Campus Facilities",
    "content": "CMU-Africa maintains several specialized computer labs. The General Computing Lab has 50 workstations with industry-standard software for coursework. The AI/ML Lab features GPU-accelerated machines for deep learning research. The IoT Lab includes hardware development tools, sensors, and embedded systems equipment. The Cybersecurity Lab provides an isolated network environment for security research. All labs are accessible 24/7 with valid ID cards. Technical support is available during business hours.",
    "metadata": {
      "last_updated": "2024-10-05",
      "language": "en"
    }
  },
  {
    "id": "student_life_001",
    "title": "Student Organizations and Activities",
    "category": "Student Life",
    "content": "CMU-Africa has active student organizations including the Student Government Association, Technical Clubs (AI Club, Robotics Club, Cybersecurity Club), Social and Cultural Clubs, and Sports Teams. Regular events include tech talks, workshops, hackathons, cultural celebrations, and sports tournaments. The campus also hosts industry networking events and career fairs.",
    "metadata": {
      "last_updated": "2024-09-01",
      "language": "en"
    }
  },
  {
    "id": "admissions_001",
    "title": "Admission Requirements",
    "category": "Admissions",
    "content": "Admission to CMU-Africa requires a bachelor's degree in a relevant field (Computer Science, Engineering, or related discipline) with strong academic performance. Applicants must submit GRE scores (recommended but not always required), TOEFL or IELTS scores (for non-native English speakers), letters of recommendation (typically 3), a statement of purpose, and a current CV/resume. Relevant work experience is valuable but not mandatory. The application deadline is typically in January for programs starting in August.",
    "metadata": {
      "last_updated": "2024-08-01",
      "language": "en"
    }
  },
  {
    "id": "support_001",
    "title": "Student Support Services",
    "category": "Student Services",
    "content": "CMU-Africa provides comprehensive student support including academic advising, career counseling, mental health and wellness services, international student support, housing assistance, and financial aid guidance. The Student Services office is located in the Main Building (Room 105) and is open Monday-Friday 9:00 AM to 5:00 PM. Students can book appointments online or walk in during office hours.",
    "metadata": {
      "last_updated": "2024-09-10",
      "language": "en"
    }
  },
  {
    "id": "housing_001",
    "title": "Student Housing Options",
    "category": "Housing",
    "content": "CMU-Africa assists students in finding housing near campus. Options include university-affiliated apartments, shared housing with other students, and private rentals. University-affiliated housing is located within 10 minutes of campus and includes furnished apartments with utilities, internet, and security. Housing costs range from $300-600 per month depending on the option selected. The housing office helps new students secure accommodation before arrival.",
    "metadata": {
      "last_updated": "2024-09-01",
      "language": "en"
    }
  }
]
